NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_flpr.svd
        <cluster>
          <name>CRYPTMSTRHW</name>
          <description>Unspecified</description>
          <headerStructName>CRACENCORE_CRYPTMSTRHW</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>INCLIPSHWCFG</name>
            <description>Incuded IPs Hardware configuration</description>
            <addressOffset>0x00</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000771</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BA411AESINCLUDED</name>
                <description>Generic g_IncludeAES value.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA415HPAESGCMINCLUDED</name>
                <description>Generic g_IncludeAESGCM value.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA416HPAESXTSINCLUDED</name>
                <description>Generic g_IncludeAESXTS value.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA412DESINCLUDED</name>
                <description>Generic g_IncludeDES value.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA413HASHINCLUDED</name>
                <description>Generic g_IncludeHASH value.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA417CHACHAPOLYINCLUDED</name>
                <description>Generic g_IncludeChachaPoly value.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA418SHA3INCLUDED</name>
                <description>Generic g_IncludeSHA3  value.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA421ZUCINCLUDED</name>
                <description>Generic g_IncludeZUC  value.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA419SM4INCLUDED</name>
                <description>Generic g_IncludeSM4  value.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA414EPPKEINCLUDED</name>
                <description>Generic g_IncludePKE  value.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA431NDRNGINCLUDED</name>
                <description>Generic g_IncludeNDRNG  value.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA420HPCHACHAPOLYINCLUDED</name>
                <description>Generic g_IncludeHPChachaPoly  value.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA423SNOW3GINCLUDED</name>
                <description>Generic g_IncludeSnow3G  value.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA422KASUMIINCLUDED</name>
                <description>Generic g_IncludeKasumi  value.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA411EAESHWCFG1</name>
            <description>Generic g_AesModesPoss value.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x070301FF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BA411EAESHWCFGMODE</name>
                <description>Generic g_AesModesPoss value.</description>
                <lsb>0</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA411EAESHWCFGCS</name>
                <description>Generic g_CS value.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA411EAESHWCFGMASKING</name>
                <description>Generic g_UseMasking value.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA411EAESHWCFGKEYSIZE</name>
                <description>Generic g_Keysize value.</description>
                <lsb>24</lsb>
                <msb>26</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA411EAESHWCFG2</name>
            <description>Generic g_CtrSize value.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000080</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BA411EAESHWCFG2</name>
                <description>Generic g_CtrSize value.</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA413HASHHWCFG</name>
            <description>Generic g_Hash value</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0003003F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BA413HASHHWCFGMASK</name>
                <description>Generic g_HashMaskFunc value.</description>
                <lsb>0</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA413HASHHWCFGPADDING</name>
                <description>Generic g_HashPadding value.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA413HASHHWCFGHMAC</name>
                <description>Generic g_HMAC_enabled value.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BA413HASHHWCFGVERIFYDIGEST</name>
                <description>Generic g_HashVerifyDigest value.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA418SHA3HWCFG</name>
            <description>Generic g_Sha3CtxtEn value.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BA418SHA3HWCFG</name>
                <description>Generic g_Sha3CtxtEn value.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA419SM4HWCFG</name>
            <description>Generic g_SM4ModesPoss value.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x000201FF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BA419SM4HWCFG</name>
                <description>Generic g_SM4ModesPoss value.</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>USEMASKING</name>
                <description>Generic g_sm4UseMasking value.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BA424ARIAHWCFG</name>
            <description>Generic g_aria_modePoss value.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000017F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BA424ARIAHWCFG</name>
                <description>Generic g_aria_modePoss value.</description>
                <lsb>0</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RNGCONTROL</name>
          <description>Unspecified</description>
          <headerStructName>CRACENCORE_RNGCONTROL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1000</addressOffset>
          <register>
            <name>CONTROL</name>
            <description>Control register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00040000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable the RNG. Clearing this bit resets the RNG FSM.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LFSREN</name>
                <description>Select between the RNG with asynchronous free running ring oscillators (when 0) and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when 1).</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>TESTEN</name>
                <description>Select input for conditioning function and continuous tests:</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Noise source (normal mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TEST</name>
                    <description>Test data register (test mode).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONDBYPASS</name>
                <description>Conditioning function bypass.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>the conditioning function is used (normal mode).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYPASS</name>
                    <description>the conditioning function is bypassed (to observe entropy source directly).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTENREP</name>
                <description>Interrupt enable for Repetition Count Test failure.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>INTENPROP</name>
                <description>Interrupt enable for Adaptive Proportion Test failure (1024-sample window).</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>INTENFULL</name>
                <description>Interrupt enable for FIFO full.</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>SOFTRST</name>
                <description>Software reset:</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Normal mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CTEST</name>
                    <description>The continuous test, the conditioning function and the FIFO are reset.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTENPRE</name>
                <description>Interrupt enable for AIS31 preliminary noise alarm.</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>INTENALM</name>
                <description>Interrupt enable for AIS31 noise alarm.</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>FORCEACTIVEROS</name>
                <description>Force oscillators to run when FIFO is full.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>HEALTHTESTBYPASS</name>
                <description>Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state.</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>AIS31BYPASS</name>
                <description>Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state.</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>HEALTHTESTSEL</name>
                <description>Select input to health test module:</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BEFORE</name>
                    <description>Before conditioning.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AFTER</name>
                    <description>After conditioning.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AIS31TESTSEL</name>
                <description>Select input to the AIS31 test module:</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BEFORE</name>
                    <description>Before conditioning.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AFTER</name>
                    <description>After conditioning.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NB128BITBLOCKS</name>
                <description>Number of 128 bit blocks used in AES-CBCMAC post-processing.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>FIFOWRITESTARTUP</name>
                <description>Enable write of the samples in the FIFO during start-up.</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FIFOLEVEL</name>
            <description>FIFO level register.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FIFOLEVEL</name>
                <description>Number of 32 bits words of random values available in the FIFO.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <readAction>modifyExternal</readAction>
              </field>
            </fields>
          </register>
          <register>
            <name>FIFOTHRESHOLD</name>
            <description>FIFO threshold register.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000003</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FIFOTHRESHOLD</name>
                <description>FIFO level threshold below which the module leaves the idle state to refill the FIFO. Expressed in number of 128bit blocks.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FIFODEPTH</name>
            <description>FIFO depth register.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FIFODEPTH</name>
                <description>Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>KEY[%s]</name>
            <description>Description collection: Key register.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>KEY</name>
                <description>Key register.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTDATA</name>
            <description>Test data register.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTDATA</name>
                <description>Test data register.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>REPEATTHRESHOLD</name>
            <description>Repetition Test Count Cut-Off value.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000029</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>REPEATTHRESHOLD</name>
                <description>Repetition Test Count Cut-Off value.</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PROPTHRESHOLD</name>
            <description>Adaptive Proportion Test (1024-sample window) Cut-Off value.</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000319</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PROPTHRESHOLD</name>
                <description>Adaptive Proportion Test (1024-sample window) Cut-Off value.</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
            </fields>
          </register>
