NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_flpr.svd
          <register>
            <name>DMCONTROL</name>
            <description>Debug Module Control</description>
            <addressOffset>0x40</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DMACTIVE</name>
                <description>Reset signal for the debug module.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Reset the debug module itself</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Normal operation</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NDMRESET</name>
                <description>Reset signal output from the debug module to the system.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Inactive</name>
                    <description>Reset inactive</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Active</name>
                    <description>Reset active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLRRESETHALTREQ</name>
                <description>Clear the halt on reset request.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation when written 0.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clears the halt on reset request</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SETRESETHALTREQ</name>
                <description>Set the halt on reset request.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation when written 0.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Set</name>
                    <description>Sets the halt on reset request</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HARTSELHI</name>
                <description>The high 10 bits of hartsel.</description>
                <lsb>6</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>HARTSELLO</name>
                <description>The low 10 bits of hartsel.</description>
                <lsb>16</lsb>
                <msb>25</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>HASEL</name>
                <description>Definition of currently selected harts.</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Single</name>
                    <description>Single hart selected.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Multiple</name>
                    <description>Multiple harts selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ACKHAVERESET</name>
                <description>Clear the havereset.</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation when written 0.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clears the havereset for selected harts.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HARTRESET</name>
                <description>Reset harts.</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Deasserted</name>
                    <description>Reset de-asserted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Asserted</name>
                    <description>Reset asserted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESUMEREQ</name>
                <description>Resume currently selected harts.</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No operation when written 0.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Resumed</name>
                    <description>Currently selected harts resumed.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HALTREQ</name>
                <description>Halt currently selected harts.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clear</name>
                    <description>Clears halt request bit for all currently selected harts.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Halt</name>
                    <description>Currently selected harts halted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DMSTATUS</name>
            <description>Debug Module Status</description>
            <addressOffset>0x44</addressOffset>
            <access>read-only</access>
            <resetValue>0x00400082</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VERSION</name>
                <description>Version of the debug module.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotPresent</name>
                    <description>Debug module not present.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>V011</name>
                    <description>There is a Debug Module and it conforms to version 0.11 of this specifcation.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>V013</name>
                    <description>There is a Debug Module and it conforms to version 0.13 of this specifcation.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonConform</name>
                    <description>There is a Debug Module but it does not conform to any available version of the spec.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONFSTRPTRVALID</name>
                <description>Configuration string.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotRelevant</name>
                    <description>The confstrptr0..confstrptr3 holds information which is not relevant to the configuration string.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Address</name>
                    <description>The confstrptr0..confstrptr3 holds the address of the configuration string.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HASRESETHALTREQ</name>
                <description>Halt-on-reset support status.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Halt-on-reset is supported.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Halt-on-reset is not supported.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTHBUSY</name>
                <description>Authentication busy status.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>The authentication module is ready.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>The authentication module is busy.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTHENTICATED</name>
                <description>Authentication status.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Authentication required before using the debug module.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Authentication passed.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYHALTED</name>
                <description>Any currently selected harts halted status.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts halted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts halted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLHALTED</name>
                <description>All currently selected harts halted status.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts halted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts halted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYRUNNING</name>
                <description>Any currently selected harts running status.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts running.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts running.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLRUNNING</name>
                <description>All currently selected harts running status.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts running.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts running.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYUNAVAIL</name>
                <description>Any currently selected harts unavailable status.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts unavailable.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts unavailable.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLUNAVAIL</name>
                <description>All currently selected harts unavailable status.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts unavailable.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts unavailable.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYNONEXISTENT</name>
                <description>Any currently selected harts nonexistent status.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts nonexistent.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts nonexistent.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLNONEXISTENT</name>
                <description>All currently selected harts nonexistent status.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts nonexistent.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts nonexistent.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYRESUMEACK</name>
                <description>Any currently selected harts acknowledged last resume request.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts acknowledged last resume request.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts acknowledged last resume request.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLRESUMEACK</name>
                <description>All currently selected harts acknowledged last resume</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts acknowledged last resume request.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts acknowledged last resume request.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ANYHAVERESET</name>
                <description>Any currently selected harts have been reset and reset is not acknowledged.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>None of the currently selected harts have been reset and reset is not acknowledget.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Any of the currently selected harts have been reset and reset is not acknowledge.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLHAVERESET</name>
                <description>All currently selected harts have been reset and reset is not acknowledge</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>Not all of the currently selected harts have been reset and reset is not acknowledge.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>All of the currently selected harts have been reset and reset is not acknowledge.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IMPEBREAK</name>
                <description>Implicit ebreak instruction at the non-existent word immediately after the Program Buffer.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>No</name>
                    <description>No implicit ebreak instruction.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Implicit ebreak instruction.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
